Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/court_offices/office_of_wards_of_court.html.txt.tmx
Source language: en
Languages: ga

source: Office of Wards of Court
ga: Oifig na gCoimircithe Cúirte

source: The High Court may provide wardship to a person who, whether by reason of mental capacity or infancy, is deemed by the court to be incapable of managing his/her affairs for him/herself. The purpose of wardship of the court is to protect the person and his/her property
ga: Is féidir leis an Árd Chúirt coimirceacht a chur ar fáil do dhuine a chineann an chúirt, ar chúis cumas intinne nó aoise, nach bhfuil ábalta a gcúrsaí féin a bhainistiú dó/di féin.’ Sé cuspóir choimirceacht cúirte ná an duine agus a s(h)eilbh a chosaint

source: The Office of Wards of Court:
ga: Bíonn Oifig na gCoimircithe Cúirte

source: • is responsible for the supervision of the affairs of persons taken into the wardship of the High Court,
ga: • Freagrach as maoirseacht chúrsaí na ndaoine atá faoi choimirceacht na hArd Chúirte

source: • provides support to the President of the High Court, the judge responsible for wardship matters,
ga: • Ag cur tacaíocht ar fáil do Uachtarán na hArd Chúirte, an breitheamh atá freagrach as ábhair a bhaineann le coimirceacht

source: • supervises the activities of the persons (known as committees or, in the case of minors, guardians) who are given responsibility for the day to day management of a ward's affairs,
ga: • Ag maoirsiú gníomhaíochtaí na ndaoine ( ar a dtugtar coistí, nó i gcás pháistí faoi ocht mbliana déag d'aois, caomhnóirí) a mbíonn freagrach as bainistiú chúrsaí coimircí ó lá go lá

source: • registers enduring powers of attorney
ga: • Clárú cúmhachtaí aturnae seasmhach
